БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаОперативнойЗадолженности</Name>
			<BasedOn>
				<xr:Item>Document.CW_КорректировкаАктированияСчетов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.CW_МСФО</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяКредиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОперативнаяДебиторскаяЗадолженность</xr:Item>
				<xr:Item>AccumulationRegister.CW_ОплатаИсходящихСчетов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаВходящихДокументов</xr:Item>
				<xr:Item>InformationRegister.CW_ОплатаИсходящихДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыОперацийКорректировкиОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.CW_МСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ВидыСубконтоМСФО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговоруКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписаниеОперативнойЗадолженности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументАкт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыОперативнойЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
								<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗадолженности</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперацийКорректировкиОперативнойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийКорректировкиОперативнойЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносЗадолженности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаОперативнойЗадолженности/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ПредставлениеДокумента");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.ПредставлениеДокумента) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.ПредставлениеДокумента;             
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЗначенияЗаполнения");
	
	ВидОперации = Неопределено; 

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидОперации");
	КонецЕсли;

	// Если документ копируется, то вид формы получаем из копируемого документа.
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Параметры.ЗначениеКопирования, "ВидОперации");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияЗаполнения, "ВидОперации");
	КонецЕсли; 

	СтандартнаяОбработка = Ложь;
	
	ФормыКорректировкиОперативнойЗадолженност = ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыКорректировкиОперативнойЗадолженност[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт	
	
	ВсеВидыОпераций = Перечисления.CW_ВидыОперацийКорректировкиОперативнойЗадолженности;
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(ВсеВидыОпераций.ЗачетЗадолженности, 		"ФормаЗачетЗадолженности");
	Соответствие.Вставить(ВсеВидыОпераций.СписаниеЗадолженности, 	"ФормаСписаниеЗадолженности");
	Соответствие.Вставить(ВсеВидыОпераций.ПереносЗадолженности, 	"ФормаПереносЗадолженности");

	Возврат Соответствие;
	
КонецФункции

Процедура ОбработатьДокументы() Экспорт

	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_КорректировкаОперативнойЗадолженности.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	Документ.CW_КорректировкаОперативнойЗадолженности КАК CW_КорректировкаОперативнойЗадолженности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Регистратор КАК Регистратор,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Счет КАК Счет,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Валюта КАК Валюта,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.СчетУчета КАК СчетУчета,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Всего_Валюта КАК СуммаВал,
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Всего КАК Сумма
	               |ПОМЕСТИТЬ ВТ_Двдижения
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность КАК CW_ОперативнаяДебиторскаяЗадолженность
	               |ГДЕ
	               |	CW_ОперативнаяДебиторскаяЗадолженность.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Документы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_Документы КАК ВТ_Документы)
	               |	И CW_ОперативнаяДебиторскаяЗадолженность.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.КурсоваяРазница)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Регистратор,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Счет,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Валюта,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.СчетУчета,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Всего_Валюта,
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Всего
	               |ИЗ
	               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность КАК CW_ОперативнаяКредиторскаяЗадолженность
	               |ГДЕ
	               |	CW_ОперативнаяКредиторскаяЗадолженность.Регистратор В
	               |			(ВЫБРАТЬ
	               |				ВТ_Документы.Ссылка КАК Ссылка
	               |			ИЗ
	               |				ВТ_Документы КАК ВТ_Документы)
	               |	И CW_ОперативнаяКредиторскаяЗадолженность.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.CW_ВидыДвиженийПоОперативнойЗадолженности.КурсоваяРазница)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Двдижения.Регистратор КАК Регистратор,
	               |	ВТ_Двдижения.Счет КАК Счет,
	               |	ВТ_Двдижения.Счет.Дата КАК СчетДата,
	               |	ВТ_Двдижения.Валюта КАК Валюта,
	               |	ВТ_Двдижения.СчетУчета КАК СчетУчета,
	               |	ВТ_Двдижения.СуммаВал КАК СуммаВал,
	               |	ВТ_Двдижения.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ_Двдижения КАК ВТ_Двдижения
	               |ИТОГИ ПО
	               |	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		РегистраторОбъект = ВыборкаРегистратор.Регистратор.ПолучитьОбъект(); 
		
		// пропускаем битые ссылки
		Если РегистраторОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаДвижения = ВыборкаРегистратор.Выбрать();
		Пока ВыборкаДвижения.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДокументСчет", 		ВыборкаДвижения.Счет);
			Отбор.Вставить("СчетЗадолженности", ВыборкаДвижения.СчетУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.СписаниеОперативнойЗадолженности.НайтиСтроки(Отбор);   
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.ДебиторскаяЗадолженность.НайтиСтроки(Отбор);
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
			мСтрокиТаблицы = РегистраторОбъект.КредиторскаяЗадолженность.НайтиСтроки(Отбор);
			ЗаполнитьДанныеСтрок(мСтрокиТаблицы, РегистраторОбъект, ВыборкаДвижения, ВалютаРегламентированногоУчета);
			
		КонецЦикла;
		
		РегистраторОбъект.ОбменДанными.Загрузка = Истина;
		РегистраторОбъект.ДополнительныеСвойства.Вставить("ОтключитьЛогикуПроведения", Истина);
		РегистраторОбъект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСтрок(мСтрокиТаблицы, Знач РегистраторОбъект, Знач ВыборкаДвижения, Знач ВалютаРегламентированногоУчета)
	
	Для Каждого СтрокаТаблицы из мСтрокиТаблицы Цикл 
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			Продолжить;
		КонецЕсли;
		
		КурсПоСтроке 		= 1; 
		КратностьПоСтроке 	= 1;   
		
		Если ВыборкаДвижения.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			КурсПоСтроке = ?(ВыборкаДвижения.СуммаВал = 0, 1, Окр(ВыборкаДвижения.Сумма / ВыборкаДвижения.СуммаВал, 4));
			
			ДатаКурса = РегистраторОбъект.Дата;
			Если ЗначениеЗаполнено(ВыборкаДвижения.Счет) тогда
				ДатаКурса = ВыборкаДвижения.СчетДата;
			КонецЕсли;   
			ДанныеКурса = CW_Финансы.ПолучитьКурсВалюты(ВыборкаДвижения.Валюта, ДатаКурса);
			
			КратностьПоСтроке 	= ?(ДанныеКурса.Кратность=0, 1, ДанныеКурса.Кратность);  
			КурсПоСтроке		= Окр(КурсПоСтроке * КратностьПоСтроке, 4);   
			
		КонецЕсли;
		
		СтрокаТаблицы.Валюта	= ВыборкаДвижения.Валюта; 
		СтрокаТаблицы.Курс 		= КурсПоСтроке;
		СтрокаТаблицы.Кратность	= КратностьПоСтроке;
		СтрокаТаблицы.Сумма		= ВыборкаДвижения.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры
